Revit 2027 API
ParameterTypeId.BeamSystem3dParam Property
 "Non-planar"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BeamSystem3dParam { get; }
Public Shared ReadOnly Property BeamSystem3dParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BeamSystem3dParam {
	ForgeTypeId^ get ();
}
static member BeamSystem3dParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace